// https://javascript.alphacamp.co/loop.html


// 寫出基本的跑10次的while迴圈，印出1 ~ 10的數字

// 寫出基本的跑10次的for迴圈，印出1 ~ 10的數字

// 寫出迴圈跑三次，連結每次的index字串，結果是"012"

// 寫出迴圈跑三次，裡面跑三次，結果是"012 012 012"

// 用for寫出九九乘法表

// 用while + if寫出終極密碼

// 用迴圈while or for，計算1加到100(1 + 2 + 3... + 100)的結果

// 給一個陣列 
// let arr = [100, 200, 300]
// 用迴圈遍歷arr並印出大於100的數字的index跟數字本身 （需搭配if）

// 給一個陣列 
// let arr = [100, 200, 300]
// 用迴圈遍歷arr並修改大於100的數字變成999 （需搭配if）

// 給一個陣列 
// let arr = [100, 200, 300]
// 用迴圈遍歷arr並修改大於100的數字變成999 （需搭配if）


